package hw_pattern.task12_SmartHome;

public class Task {
    /**
     * Фасад для системы "Умный дом"
     * Описание
     * В системе "Умный дом" есть несколько устройств, которые управляют:
     * Светом (включить/выключить).
     * Кондиционером (включить/выключить).
     * Системой безопасности (включить/выключить).
     * Клиенту нужно предоставить единый интерфейс для управления (включение/выключение)
     * всеми этими устройствами, скрыв детали реализации каждого из них. Используем фасад,
     * который объединит все эти операции в один интерфейс. **/


}
